eisup_2019_docmng_integration/src/Documents/абс_РаспределениеФОТПоПроектам/абс_РаспределениеФОТПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределениеФОТПоПроектам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределениеПоПроектам</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_РаспределениеФОТПоПроектам/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьИтогПоЦФО(ЦФО)

	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	СуммаПоЦФО = 0;
	Если мЦФО.Количество() > 0 Тогда
		Для каждого Стр Из мЦФО Цикл
			СуммаПоЦФО = СуммаПоЦФО + Стр.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Возврат  СуммаПоЦФО;
	
КонецФункции 

&НаСервере
Процедура ОбновитьСуммыДляРаспределения()
	ТЗ = Объект.РаспределениеПоПроектам.Выгрузить();	
	ТЗ.Свернуть("ЦФО","Сумма");
	ЗначениеВРеквизитФормы(ТЗ,"СуммыДляРаспределения");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ   

&НаСервере
Процедура ИзменитьРаспределение(ЦФО,Удалить)
	
	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	
	Если мЦФО.Количество() = 0 Тогда
		НС =  Объект.РаспределениеПоПроектам.Добавить();
		НС.ЦФО = ЦФО;
		
		Если  Объект.СуммаПоДокументу > 0 Тогда
			СуммаВСтроку = Объект.СуммаПоДокументу - Объект.РаспределениеПоПроектам.Итог("Сумма");
			НС.Сумма = ?(СуммаВСтроку < 0,0,СуммаВСтроку);
		КонецЕсли;
		
	ИначеЕсли мЦФО.Количество() > 0  И Удалить Тогда
		Для каждого Стр Из мЦФО Цикл
			Объект.РаспределениеПоПроектам.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                       
Процедура ИзменитьСуммыДляРаспределения(ЦФО,Удалить)
	
	мЦФО = СуммыДляРаспределения.НайтиСтроки(Новый Структура("ЦФО",ЦФО));
	
	Если мЦФО.Количество() = 0 Тогда
		НС =  СуммыДляРаспределения.Добавить();
		НС.ЦФО = ЦФО;
	ИначеЕсли мЦФО.Количество() > 0  И Удалить Тогда
		Для каждого Стр Из мЦФО Цикл
			СуммыДляРаспределения.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда	
		ИзменитьРаспределение(Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО,Ложь);
	КонецЕсли;	
	
	ОбновитьСуммыДляРаспределения();

КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПередУдалением(Элемент, Отказ)
	Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда	
		ИзменитьРаспределение(Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО,Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоПроектамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЦФО = Элементы.РаспределениеПоПроектам.ТекущиеДанные.ЦФО;
	
	Если  НоваяСтрока Тогда
		СуммаВСтроку = Объект.СуммаПоДокументу - (Объект.РаспределениеПоПроектам.Итог("Сумма") - Элементы.РаспределениеПоПроектам.ТекущиеДанные.Сумма);
		Элементы.РаспределениеПоПроектам.ТекущиеДанные.Сумма = ?(СуммаВСтроку < 0, 0,СуммаВСтроку);
	КонецЕсли;
	
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоПроектамПослеУдаления(Элемент)
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСуммыДляРаспределения();
КонецПроцедуры

&НаКлиенте
Процедура СуммыДляРаспределенияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	//Если Элементы.СуммыДляРаспределения.ТекущиеДанные <> Неопределено Тогда
	//	мЦФО = Объект.РаспределениеПоПроектам.НайтиСтроки(Новый Структура("ЦФО",Элементы.СуммыДляРаспределения.ТекущиеДанные.ЦФО));
	//	
	//	Если мЦФО.Количество() > 0 Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Выбранное ЦФО уже есть в списке!";
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
